04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/mixerSRF/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.375;
    }
    rotor
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    outerWall
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    cyclic_half0
    {
        type            cyclic;
        value           uniform 0.375;
    }
    cyclic_half1
    {
        type            cyclic;
        value           uniform 0.375;
    }
}


// ************************************************************************* //
